"""print ("Ну здарвствуй, лысина")
print (2+2)
print (4*2)
print (5//2)
print(2/3)
print (5%2)"""
"""int=1# целые числа
type_float=1.23 # числа  с точкой
type_str= "сттроки пишутся в ковыччках"
type_bool_one= True  # булевы значения истина (правда)
type_bool_two = False #булевы значения ложь
type_none = None#  пустышка например для проверки или выполнение функци при перемонной пустоты
"""
"""x=5
y=123
print(x*2)
print(x*3)
print(x*4)
print(x*5)
print(x*7)
print(x*8)
print(x*9)
print(x*6)
print(x*y)*/
"""
"""a=1233
print (a * 2, type(a))
a=str(a)
print (a)
a=float(a)
print (a,type(a)) """
"""c = int(input ("введите число - мы емножим его на 2: ")) # инпут по умолчанию строчный
c=int(c)# таким образом меняю тип данных которые вуодит пользщователь на численные и их уже можно перемножать делить и тд
print (c*2)
"""
print("Заполните красткую информациб о себе")
name=input("введите имя")
print(name)
age=input("Укажите свой возраст")
age=str(age)
f=input("расскажите о вашем хоби")
print ('уважаемый пользователь мы выяснили как вас зовут и сколько вам лет а так же ваше хоби' )
ask=input('Расскажите чем мы можем вам помочь? возможно  рассказать что мы выяснили? если это так то введите da')
print (name,age,ask,f)