"""n=input("Введите свое имя")
f=input("Введите свою фамилию")
a=input("Укажите возраст")
n=input("Ваш номер телефона")
n=int(n)
a=str(a)
h=input("Что насчет увлечений?")
print("вот что мы смогли о тебе узнать")
print ("Ваше имя: ",n)
print("Ваша  фамилия: ",f)
print("Ваш возраст: ",a)
print("Ваш контактный номмер: ", n)
print("Вы любите: ",h)"""

#конкотенация это сложение строк
"""
name="Илья"
print("Привет"+" "+ name) # переменные в конкатенации пишется без ковычек
print(f"Привет {name}") # f это команда шаблона для переменной что бы сработало ставим переменную в фигурные скобки можно вместо переменной в фигурные скобки запихать математическое задание или любую формулу
print("Привет","","Мир!")"""
"""
x=int(input("введите число"))
x1=x%10
x=x//10
x2=x%10
x=x//10
x3=x%10
x=x//10
x4=x%10
x=x//10
print(x1)
print(x2)
print(x3)
print(x4)
print(x1+x2+x3+x4)"""

y=int(input("введите число"))
y1=y%10
y=y//10
y2=y%10
y=y//10
y3=y%10
y=y//10
y4=y%10
y=y//10
print(y1)
print(y2)
print(y3)
print(y4)
print(y1+y2+y3+y4)